app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "WAKE UP"], ["created_at", "2018-11-28 17:40:08.505582"], ["updated_at", "2018-11-28 17:40:08.505582"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save